In [7]:
#!pip install pandas

In [27]:
import pandas as pd

In [28]:
data=[1,2,3,45]

In [29]:
data

[1, 2, 3, 45]

In [30]:
type(data)

list

In [31]:
#create a series from list
s=pd.Series(data)

In [32]:
s

0     1
1     2
2     3
3    45
dtype: int64

In [33]:
type(s)

pandas.core.series.Series

In [34]:
#create a dataFrame from series
df=pd.DataFrame(s, columns=['num'])
df

   num
0    1
1    2
2    3
3   45

In [35]:
#create a series for 2 int columns
data = [[1,2],[3,4],[5,8]]
data

[[1, 2], [3, 4], [5, 8]]

In [36]:
#create a dataFrame from list and remane the columns
df = pd.DataFrame(data, columns=['num1','num2'])

In [37]:
df

   num1  num2
0     1     2
1     3     4
2     5     8

In [38]:
#Create a Series from the DatFrame
s=df[['num1','num2']]
print(s)

   num1  num2
0     1     2
1     3     4
2     5     8

# Dictionary to Series and DataFrame

In [39]:
# Create a Dict

data = {
    'name':["Mili","Jim","Simi"],
    'age':[25,24,27],
    'city':["Dhaka","Jessore","Khulna"]
}
data

{'name': ['Mili', 'Jim', 'Simi'],
 'age': [25, 24, 27],
 'city': ['Dhaka', 'Jessore', 'Khulna']}

In [40]:
#Create a Series from the dict
name_Series = pd.Series(data['name'], name='Name')
name_Series

0    Mili
1     Jim
2    Simi
Name: Name, dtype: object

In [41]:
df = pd.DataFrame(data)
df

   name  age     city
0  Mili   25    Dhaka
1   Jim   24  Jessore
2  Simi   27   Khulna

In [42]:
age_Series = df['age']
age_Series

0    25
1    24
2    27
Name: age, dtype: int64

# Set to Series and DataFrame

In [43]:
s1 = {1,2,3,4,5,6,7}
s1

{1, 2, 3, 4, 5, 6, 7}

In [44]:
type(s1)

set

In [45]:
s = pd.Series(s1)
s

TypeError: 'set' type is unordered

#So Set to Series is not possible directly , because 'set' type is unordered. To solve this - set to list and then list to Series.!!

In [46]:
s = pd.Series(list(s1))
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [47]:
df = pd.DataFrame(s1,columns=['set value'])
df

   set value
0          1
1          2
2          3
3          4
4          5
5          6
6          7

# Tuple to Series and DataFrame

In [55]:
t = (1,2,3,4,5,6,7,8,9, True, False)
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, True, False)

In [56]:
s = pd.Series(t)
s

0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8
8         9
9      True
10    False
dtype: object

In [50]:
df = pd.DataFrame(t)
df

        0
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9    True
10  False

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       11 non-null     object
dtypes: object(1)
memory usage: 216.0+ bytes

In [52]:
# dataFarame size (row)
df.size

11

In [53]:
# dataFarame size (row, column)
df.shape

(11, 1)

In [57]:
# First 3 row of dataFarame 
df.head(3)

   0
0  1
1  2
2  3